#dp[i][j] =: i,j 번째 칸에 사자를 배치할때 배치할 수 있는 경우의 수
#j = 0 이면 왼쪽, 1이면 오른쪽, 2면 배치 안함
#대각선으로만 배치할 수 있으므로,
#     dp[i][0] = dp[i - 1][1] + dp[i - 1][2]
#     dp[i][1] = dp[i - 1][0] + dp[i - 1][2]
#     dp[i][2] = dp[i - 1][0] + dp[i - 1][1] + dp[i - 1][2]

n = int(input())
dp = [[0]*3 for i in range(n)]
dp[0][0] = 1
dp[0][1] = 1
dp[0][2] = 1

for i in range(1, n):
    dp[i][0] = (dp[i - 1][1] + dp[i - 1][2]) % 9901
    dp[i][1] = (dp[i - 1][0] + dp[i - 1][2]) % 9901
    dp[i][2] = (dp[i - 1][0] + dp[i - 1][1] + dp[i - 1][2]) % 9901
print((dp[n - 1][0] + dp[n - 1][1] + dp[n - 1][2]) % 9901)